gpplay6521-cmd/masa-paneli/panel-firmware/sdkconfig.defaults
# Elecrow V1.3 örneğinden (Lesson03-LVGL_Control_LED) alınan kart ayarları + bu projeye özel değerler
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL 9.1 (bileşen Kconfig'i): yazı tipleri, degrade, bellek
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_GRADIENT_MAX_STOPS=3
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_PLACEHOLDER=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_BIDI=y
CONFIG_LV_BIDI_DIR_AUTO=y
CONFIG_LV_USE_ARABIC_PERSIAN_CHARS=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 921600 bps kapak aktarımı: UART kesmesi, flaş yazımı (NVS) sırasında da çalışsın
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
